Revit 2027 API
BuiltInFailures.StairRampFailures.ActualRiserHeightChanged Property
 The actual riser height for one or more stairs violates the maximum set in the type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ActualRiserHeightChanged { get; }
Public Shared ReadOnly Property ActualRiserHeightChanged As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ActualRiserHeightChanged {
	FailureDefinitionId^ get ();
}
static member ActualRiserHeightChanged : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace